XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_i3c.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32v4x7_i3c.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/12/01
* Description        : This file provides all the I3C firmware functions.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32v4x7_i3c.h"
#include "ch32v4x7_rcc.h"

/*********************************************************************
 * @fn      I3C_DeInit
 *
 * @brief De-initializes the I3C peripheral registers to their default
 * 
 * @return None
 */
void I3C_DeInit(void)
{
    RCC_HBPeriphResetCmd(RCC_HBPeriph_I3C, ENABLE);
    RCC_HBPeriphResetCmd(RCC_HBPeriph_I3C, DISABLE);
}

/*********************************************************************
 * @fn      I3C_Ctrl_Init
 *
 * @brief   Initializes the I3C control bus registers according to the 
 *        specified parameters in the I3C_Ctrl_BusTypeDef structure.
 * 
 * @param   I3C_InitStruct - pointer to a I3C_Ctrl_BusTypeDef structure that
 *        contains the configuration information for the I3C control bus.
 *
 * @return  none
 */
void I3C_Ctrl_Init(I3C_Ctrl_BusTypeDef* I3C_InitStruct)
{
    uint32_t waveform_value = 0, timing_value = 0;

    I3C->CFGR = 0;

    I3C->CFGR |= I3C_CFGR_CRINIT;
    I3C->RESET &= ~I3C_RESET_HST_SIE_RST;

    waveform_value = ((uint32_t)I3C_InitStruct->SCLPPLowDuration |
                      ((uint32_t)I3C_InitStruct->SCLI3CHighDuration << 8) |
                      ((uint32_t)I3C_InitStruct->SCLODLowDuration << 16) |
                      ((uint32_t)I3C_InitStruct->SCLI2CHighDuration << 24));

    I3C->TIMINGR0 = waveform_value;

    timing_value = ((uint32_t)I3C_InitStruct->SDAHoldTime |
                    (uint32_t)I3C_InitStruct->WaitTime |
                    ((uint32_t)I3C_InitStruct->BusFreeDuration << 16) |
                    (uint32_t)I3C_InitStruct->BusIdleDuration);

    I3C->TIMINGR1 = timing_value;
}

/*********************************************************************
 * @fn      I3C_Ctrl_Config
 *
 * @brief   Sets the I3C control bus configuration according to the specified 
 *        parameters in the I3C_CtrlConfTypeDef structure.
 * 
 * @param   I3C_CtrlConf - pointer to a I3C_CtrlConfTypeDef structure that contains
 *        the configuration information for the I3C control bus.
 *
 * @return  none
 */
void I3C_Ctrl_Config(I3C_CtrlConfTypeDef* I3C_CtrlConf)
{
    uint32_t timing2_value = 0, cfgr_value = 0;

    timing2_value = (((uint32_t)I3C_CtrlConf->StallTime << 8) |
                     ((uint32_t)I3C_CtrlConf->ACKStallState << 3) |
                     ((uint32_t)I3C_CtrlConf->CCCStallState << 2) |
                     ((uint32_t)I3C_CtrlConf->TxStallState << 1) |
                     ((uint32_t)I3C_CtrlConf->RxStallState << 0));

    I3C->TIMINGR2 = timing2_value;

    cfgr_value = ((uint32_t)I3C_CtrlConf->HotJoinAllowed_EN << 7) | ((uint32_t)I3C_CtrlConf->PullUp << 6);

    I3C->CFGR |= cfgr_value;

    I3C->DEVR0 &= ~I3C_DEVR0_DA;

    I3C->DEVR0 |= (uint32_t)(I3C_CtrlConf->DynamicAddr << 1);

    I3C->DEVR0 |= I3C_DEVR0_DAVAL;
}

/*********************************************************************
 * @fn      I3C_Cmd
 *
 * @brief   Enables or disables the I3C interface.
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_Cmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_EN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_EN;
    }
}

/*********************************************************************
 * @fn      I3C_ArbitrationHeaderCmd
 *
 * @brief   Enables or disables An arbitration header (7'h7E) is sent after 
 *        Start in case of legacy I2C or I3C private transfers.
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_ArbitrationHeaderCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_NOARBH;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_NOARBH;
    }
}

/*********************************************************************
 * @fn      I3C_HJAckCmd
 *
 * @brief   Enables or disables Hot Join Request is Acked. Current frame 
 *        on the bus is continued An Hot Join interrupt is sent through HJF flag..       
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_HJAckCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_HJACK;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_HJACK;
    }
}

/*********************************************************************
 * @fn      I3C_DMAReq_RXCmd
 *
 * @brief   Enables or disables DMA FIFO reception requests.      
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_DMAReq_RXCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_RXDMAEN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_RXDMAEN;
    }
}

/*********************************************************************
 * @fn      I3C_DMAReq_TXCmd
 *
 * @brief   Enables or disables DMA FIFO transmission requests.      
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_DMAReq_TXCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_TXMAEN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_TXMAEN;
    }
}

/*********************************************************************
 * @fn      I3C_DMAReq_ControlCmd
 *
 * @brief   Enables or disables DMA FIFO Control word transfer requests.     
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_DMAReq_ControlCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_CDMAEN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_CDMAEN;
    }
}

/*********************************************************************
 * @fn      I3C_ExitPatternCmd
 *
 * @brief   Enables or disables An Exit Pattern is sent after header
 *        (MTYPE = header) to program an escalation fault.
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_ExitPatternCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->CFGR |= I3C_CFGR_EXITPTRN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_EXITPTRN;
    }
}

/*********************************************************************
 * @fn      I3C_RequestTransfer
 *
 * @brief   Request a Transfer start.
 *
 * @param   none
 *
 * @return  none
 */
void I3C_RequestTransfer(void)
{
    I3C->CFGR |= I3C_CFGR_TSFSET;
}

/*********************************************************************
 * @fn      I3C_CONTROLLER_ResetCmd
 *
 * @brief   Enables or disables Controller mode reset.
 *
 * @param   NewState - new state of the I3C interface(ENABLE or DISABLE).
 *
 * @return  none
 */
void I3C_CONTROLLER_ResetCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        I3C->RESET |= I3C_RESET_HST_SIE_RST;
    }
    else
    {
        I3C->RESET &= ~I3C_RESET_HST_SIE_RST;
    }
}

/*********************************************************************
 * @fn      I3C_SetModeConfig
 *
 * @brief   Configure peripheral mode.
 * 
 * @param   PeripheralMode - peropheral mode.
 *            PeripheralMode_CONTROLLER - Controller mode.
 *
 * @return  none
 */
void I3C_SetModeConfig(uint32_t PeripheralMode)
{
    I3C->CFGR &= ~I3C_CFGR_CRINIT;
    I3C->CFGR |= PeripheralMode;
}

/*********************************************************************
 * @fn      I3C_Ctrl_ConfigBusDevices
 *
 * @brief   Sets the I3C control bus configuration for the specified device.
 * 
 * @param   pDesc - pointer to a I3C_DeviceConfTypeDef structure that contains
 *        the configuration information for the I3C device.
 * 
 * @return none
 */
void I3C_Ctrl_ConfigBusDevices(I3C_DeviceConfTypeDef* pDesc)
{
    uint32_t value = 0;

    value = (((uint32_t)pDesc->TargetDynamicAddr << 1) |
             ((uint32_t)pDesc->IBIAck << 16) |
             ((uint32_t)pDesc->CtrlStopTransfer << 19) |
             ((uint32_t)pDesc->IBIPayload << 18));

    if (pDesc->DeviceIndex == I3C_DeviceIndex_1)
    {
        I3C->DEVR1 = value;
    }
    else if (pDesc->DeviceIndex == I3C_DeviceIndex_2)
    {
        I3C->DEVR2 = value;
    }
    else if (pDesc->DeviceIndex == I3C_DeviceIndex_3)
    {
        I3C->DEVR3 = value;
    }
    else if (pDesc->DeviceIndex == I3C_DeviceIndex_4)
    {
        I3C->DEVR4 = value;
    }
}

/*********************************************************************
 * @fn      I3C_Ctrl_SetConfigResetPattern
 *
 * @brief   Sets the I3C control bus configuration reset pattern according to the specified 
 * 
 * @param   resetPattern - specifies the reset pattern.
 * 
 * @return  none
 */
void I3C_Ctrl_SetConfigResetPattern(FunctionalState resetPattern)
{
    if (resetPattern == ENABLE)
    {
        I3C->CFGR |= I3C_CFGR_RSTPTRN;
    }
    else
    {
        I3C->CFGR &= ~I3C_CFGR_RSTPTRN;
    }
}

/*********************************************************************
 * @fn      I3C_Ctrl_GetConfigResetPattern
 *
 * @brief   Gets the I3C control bus configuration reset pattern.
 * 
 * @return  The current reset pattern configuration. 
 */
FunctionalState I3C_Ctrl_GetConfigResetPattern(void)
{
    FunctionalState status = ENABLE;
    if ((I3C->CFGR & I3C_CFGR_RSTPTRN) == I3C_CFGR_RSTPTRN)
    {
        status = ENABLE;
    }
    else
    {
        status = DISABLE;
    }

